src/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоциальнаяСеть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КороткийАдрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Координаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексОтзывы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ПолФизическогоЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ПолФизическогоЛица</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ВидыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыКонтактнойИнформации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресТолькоРоссийский</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПоляДругое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРедактирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьСтрануВПредставление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьРедактированиеПользователем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрещатьВводНекорректного</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДляФормул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределенногоВида</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсправлятьУстаревшиеАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаскаНомераТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МеждународныйФорматАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МногострочноеПоле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВводитьНомерПоМаске</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательноеЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подсказка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьКорректность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьПоФИАС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьВводНесколькихЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МожноИзменятьСпособРедактирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьНеактуальныеАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонCДобавочнымНомером</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоНациональныйАдрес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказыватьОКТМО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьИсториюИзменений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Представления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/МенеджерПочтыСервер/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

&НаСервере
// установить флаг "обработано" в выбранных документах
//
// Параметры:
//  МассивДокументов - массив выбранных документов;
//  НовыйОтветственный    - новый ответственный
//
Процедура УстановитьНовогоОтветственного(Знач МассивДокументов, НовыйОтветственный) Экспорт 

	Для Каждого ТекущийДокумент Из МассивДокументов Цикл
		
		Если ЗначениеЗаполнено(ТекущийДокумент) Тогда
			
			Попытка
				
				Если ТекущийДокумент.Ответственный <> НовыйОтветственный Тогда
					
					ТекущийДокументОбъект = ТекущийДокумент.ПолучитьОбъект(); 					
					ТекущийДокументОбъект.Ответственный = НовыйОтветственный; 					
					ТекущийДокументОбъект.Записать();
					
				КонецЕсли;
				
			Исключение
				
			КонецПопытки;	
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
// Осуществляет расширенный поиск контрагентов
// Параметры:
// ТаблицаКонтрагентов - таблица значений, заполняемая результатми поиска,
// Возвращаемое значение:
// Неопределено, если поиск произведен успешно
// Текст сообщения пользователю, если слишком много результаов или ничего не найдено
//
Функция НайтиКонтрагентов(СтрокаПоиска, ТаблицаКонтрагентов) Экспорт

	// настроить параметры поиска
	мОбластьПоиска = Новый Массив;
	РазмерПорции = 200;
	СписокПоиска = ПолнотекстовыйПоиск.СоздатьСписок(СтрокаПоиска,РазмерПорции);
	мОбластьПоиска.Добавить(Метаданные.Справочники.Контрагенты);
	СписокПоиска.ОбластьПоиска = мОбластьПоиска;

	СписокПоиска.ПерваяЧасть();

	// возврат, если поиск не результативен
	Если СписокПоиска.СлишкомМногоРезультатов() Тогда
		Возврат НСтр("ru = 'Слишком много результатов, уточните запрос.'");
	КонецЕсли;

	КоличествоЭлементов = СписокПоиска.ПолноеКоличество();
	Если КоличествоЭлементов = 0 Тогда
		Возврат НСтр("ru = 'Ничего не найдено'");
	КонецЕсли;// возврат, если поиск не результативен

	// сформировать список найденных партнеров
	ТаблицаКонтрагентов.Очистить();
	НачальнаяПозиция = 0;
	КонечнаяПозиция = ?(КоличествоЭлементов>РазмерПорции,РазмерПорции,КоличествоЭлементов)-1;
	ЕстьСледующаяПорция = Истина;

	// обработать по порциям результаты ППД
	Пока ЕстьСледующаяПорция Цикл
		Для СчетчикЭлементов = 0 По КонечнаяПозиция Цикл
			
			// сформировать элемент результата
			Элемент = СписокПоиска.Получить(СчетчикЭлементов);
			ЭлементСсылка = Элемент.Значение.Ссылка;
			Основание = Элемент.Метаданные.ПредставлениеОбъекта + " """ +
				Элемент.Представление + """ - " + Элемент.Описание;
			Если Элемент.Метаданные = Метаданные.Справочники.Контрагенты Тогда
				Партнер = Элемент.Значение;
			Иначе
				Продолжить;
			КонецЕсли;

			// добавить элемент, если партнера еще нет в списке найденных
			Если ТаблицаКонтрагентов.Найти(Партнер,"Значение") = Неопределено Тогда
				// ограничить количество возвращаемых партнеров
				Если ТаблицаКонтрагентов.Количество() > 100 Тогда
					Возврат НСтр("ru = 'Слишком много результатов, уточните запрос.'");
				Иначе // ограничить количество возвращаемых партнеров
					Запись = ТаблицаКонтрагентов.Добавить();
					Запись.Значение = Партнер;
					Запись.Основание = Основание;
					Запись.Ссылка = ЭлементСсылка;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		НачальнаяПозиция = НачальнаяПозиция + РазмерПорции;
		ЕстьСледующаяПорция = (НачальнаяПозиция < КоличествоЭлементов - 1);
		Если ЕстьСледующаяПорция Тогда
			КонечнаяПозиция = 
			?(КоличествоЭлементов > НачальнаяПозиция + РазмерПорции, РазмерПорции,
			КоличествоЭлементов - НачальнаяПозиция) - 1;
			СписокПоиска.СледующаяЧасть();
		КонецЕсли;
	КонецЦикла;

	Возврат Неопределено;

КонецФункции// НайтиКонтрагентов

&НаСервере
// Функция, возвращает контактную информацию объекта
//  Параметры:
//   Контрагенты - Контрагенты;
//   ТипКонтактнойИнформации - Тип контактной информации;
//   ПолучатьПустые - Получать пустые;      
Функция ПолучитьКонтактнуюИнформацияОбъекта(Контрагенты = Неопределено, ТипКонтактнойИнформации, ПолучатьПустые = Ложь) Экспорт
	
	флПризнакСсылки = Истина;
	
	СписокИменТаблиц = Новый СписокЗначений;
	Если НЕ Контрагенты = Неопределено Тогда 
		
		Если ТипЗнч(Контрагенты) = Тип("Массив") Тогда
			флПризнакСсылки = Ложь;
		КонецЕсли;
		
		СписокИменТаблиц.Добавить("Контрагенты");
	КонецЕсли;
	
	ТекстЗапроса = "";
	ТекстВременныхТаблиц = "";
	
	Для Каждого ЗначениеСписка ИЗ СписокИменТаблиц Цикл
		ИмяРодителя = ЗначениеСписка.Значение;

		Если ПолучатьПустые Тогда 
			
			ТекстВременныхТаблиц = ТекстВременныхТаблиц + "
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КонтактнаяИнформация.Ссылка,
			|	КонтактнаяИнформация.Вид,
			|	КонтактнаяИнформация.Представление
			|ПОМЕСТИТЬ КИ_" + ЗначениеСписка.Значение + "
			|ИЗ
			|	Справочник." + ЗначениеСписка.Значение + ".КонтактнаяИнформация КАК КонтактнаяИнформация
			|ГДЕ";
			Если ЗначениеСписка.Значение = "Контрагенты" Тогда
				ТекстВременныхТаблиц = ТекстВременныхТаблиц + "
				|	КонтактнаяИнформация.Ссылка" +?(флПризнакСсылки," = &Контрагенты"," В(&Контрагенты)");
			КонецЕсли;
			ТекстВременныхТаблиц = ТекстВременныхТаблиц + " 
			|	И КонтактнаяИнформация.Тип В(&Тип)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	" + ЗначениеСписка.Значение + ".Ссылка,
			|	ВидыКонтактнойИнформации.Ссылка КАК Вид,
			|	ВидыКонтактнойИнформации.Тип,
			|	ВидыКонтактнойИнформации.Предопределенный,
			|	ВидыКонтактнойИнформации.Родитель.Наименование
			|ПОМЕСТИТЬ ВидыКИ_По_" + ЗначениеСписка.Значение + "
			|ИЗ
			|	Справочник." + ЗначениеСписка.Значение + " КАК " + ЗначениеСписка.Значение + "
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации";
			Если ЗначениеСписка.Значение = "Контрагенты" Тогда
				ТекстВременныхТаблиц = ТекстВременныхТаблиц + "
				|		ПО (" + ЗначениеСписка.Значение + ".Ссылка" +?(флПризнакСсылки," = &Контрагенты"," В(&Контрагенты)")+")";
			КонецЕсли;
			ТекстВременныхТаблиц = ТекстВременныхТаблиц + "
			|ГДЕ
			|	(НЕ ВидыКонтактнойИнформации.ЭтоГруппа)
			|	И (НЕ ВидыКонтактнойИнформации.ПометкаУдаления)
			|	И ВидыКонтактнойИнформации.Родитель = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.Справочник" + ИмяРодителя + ")
			|	И ВидыКонтактнойИнформации.Тип В(&Тип)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВидыКИ.Ссылка,
			|	ВидыКИ.Вид,
			|	ВидыКИ.Тип,
			|	ВидыКИ.Предопределенный,
			|	ВидыКИ.РодительНаименование,
			|	КИ_" + ЗначениеСписка.Значение + ".Представление
			|ПОМЕСТИТЬ КИ_" + ЗначениеСписка.Значение + "_Итоговая
			|ИЗ
			|	ВидыКИ_По_" + ЗначениеСписка.Значение + " КАК ВидыКИ
			|		ЛЕВОЕ СОЕДИНЕНИЕ КИ_" + ЗначениеСписка.Значение + " КАК КИ_" + ЗначениеСписка.Значение + "
			|		ПО ВидыКИ.Ссылка = КИ_" + ЗначениеСписка.Значение + ".Ссылка
			|			И ВидыКИ.Вид = КИ_" + ЗначениеСписка.Значение + ".Вид
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////";
		Иначе
			ТекстВременныхТаблиц = ТекстВременныхТаблиц + "
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КонтактнаяИнформация.Ссылка,
			|	КонтактнаяИнформация.Вид,
			|	КонтактнаяИнформация.Тип,
			|	КонтактнаяИнформация.Вид.Предопределенный КАК Предопределенный,
			|	КонтактнаяИнформация.Представление
			|ПОМЕСТИТЬ КИ_" + ЗначениеСписка.Значение + "_Итоговая
			|ИЗ
			|	Справочник." + ЗначениеСписка.Значение + ".КонтактнаяИнформация КАК КонтактнаяИнформация
			|ГДЕ";
			Если ЗначениеСписка.Значение = "Контрагенты" Тогда
				ТекстВременныхТаблиц = ТекстВременныхТаблиц + "
				|	КонтактнаяИнформация.Ссылка" +?(флПризнакСсылки," = &Контрагенты"," В(&Контрагенты)");
			КонецЕсли;
			ТекстВременныхТаблиц = ТекстВременныхТаблиц + "
			|	И КонтактнаяИнформация.Тип В(&Тип)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////";
		КонецЕсли;
		
		Если ТекстЗапроса = "" Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|ВЫБРАТЬ
			|	КонтактнаяИнформация.Ссылка КАК Ссылка,
			|	КонтактнаяИнформация.Вид КАК Вид,
			|	КонтактнаяИнформация.Тип КАК Тип,
			|	КонтактнаяИнформация.Предопределенный КАК Предопределенный,
			|	ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК Представление,
			|	ВЫБОР
			|		КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
			|			ТОГДА 0
			|		КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
			|			ТОГДА 1
			|		КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Факс)
			|			ТОГДА 2
			|		КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
			|			ТОГДА 3
			|		КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.ВебСтраница)
			|			ТОГДА 4
			|		КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Другое)
			|			ТОГДА 5
			|	КОНЕЦ КАК ПолеСортировки
			|ИЗ
			|	КИ_" + ЗначениеСписка.Значение + "_Итоговая КАК КонтактнаяИнформация";
		Иначе
			ТекстЗапроса = ТекстЗапроса + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	КонтактнаяИнформация.Ссылка,
			|	КонтактнаяИнформация.Вид,
			|	КонтактнаяИнформация.Тип,
			|	КонтактнаяИнформация.Предопределенный,
			|	ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК Представление,
			|	ВЫБОР
			|		КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
			|			ТОГДА 0
			|		КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
			|			ТОГДА 1
			|		КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Факс)
			|			ТОГДА 2
			|		КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
			|			ТОГДА 3
			|		КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.ВебСтраница)
			|			ТОГДА 4
			|		КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Другое)
			|			ТОГДА 5
			|	КОНЕЦ
			|ИЗ
			|	КИ_" + ЗначениеСписка.Значение + "_Итоговая КАК КонтактнаяИнформация";
		КонецЕсли;
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	ПолеСортировки,
	|	Предопределенный УБЫВ";
	
	ТекстЗапроса = ТекстВременныхТаблиц + ТекстЗапроса;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Контрагенты", Контрагенты);
	Запрос.УстановитьПараметр("Тип",    ТипКонтактнойИнформации);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
// Функция осуществляет замену выражений вида {ИзменяемоеЗначение} на реальные данные
// в тексте письма
Процедура ОбработатьИзменяемыеЗначенияВПисьме(ТекстПисьма, Получатель) Экспорт
	
	Если ТипЗнч(ТекстПисьма) <> Тип("Строка") Тогда
		Возврат;
	КонецЕсли;
	
	Пока Истина Цикл // выход из цикла происходит по оператору "Прервать"
		
		ПозицияНачала = Найти(ТекстПисьма, "{");
		ПозицияКонца  = Найти(ТекстПисьма, "}");
		
		Если ПозицияНачала = 0
		 ИЛИ ПозицияКонца  = 0
		 ИЛИ ПозицияКонца <= ПозицияНачала Тогда
			Прервать;
		КонецЕсли;
		
		ТекстДо = Лев(ТекстПисьма, ПозицияНачала - 1);
		ИзменяемоеЗначение = Сред(ТекстПисьма, ПозицияНачала + 1, ПозицияКонца - ПозицияНачала - 1);
		ТекстПосле = Прав(ТекстПисьма, СтрДлина(ТекстПисьма) - ПозицияКонца);
		
		ТекстПисьма = ТекстДо + ПодставитьРеальноеЗначение(ИзменяемоеЗначение, Получатель) + ТекстПосле;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Функция возвращает реальное значение по переданному тексту шаблона изменяемого значения
//
Функция ПодставитьРеальноеЗначение(ИзменяемоеЗначение, Получатель)
	
	Если Найти(ИзменяемоеЗначение, "Дата") <> 0 Тогда
		
		// подставить дату нужного формата
		ФорматДаты = СтрЗаменить(ИзменяемоеЗначение, "Дата ", "");
		Возврат Формат(ТекущаяДата(), ФорматДаты);
		
	ИначеЕсли НРег(ИзменяемоеЗначение) = "уважаемый" Тогда
		
		Пол = ПолучитьПолПолучателя(Получатель);
		СЗаглавнойБуквы = (Лев(ИзменяемоеЗначение, 1) = "У");
		
		Начало   = ?(СЗаглавнойБуквы, "У", "у");
		Середина = "важаем";
		
		Если Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
			Окончание = "ый";
		ИначеЕсли Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
			Окончание = "ая";
		Иначе
			Окончание = "ый(-ая)";
		КонецЕсли;
		
		Возврат Начало + Середина + Окончание;
		
	Иначе
		
		// подставить реквизит получателя
		Если ОбщегоНазначенияСтоматология.ЕстьРеквизитДокумента(ИзменяемоеЗначение, Получатель.Метаданные()) Тогда
			Возврат Получатель[ИзменяемоеЗначение];
		Иначе
			Возврат ИзменяемоеЗначение;
		КонецЕсли;
		
	КонецЕсли;
			
КонецФункции

&НаСервере
// Функция, возвращает пол получателя
//  Параметры: 3
//   Получатель - Получатель;
//          
Функция ПолучитьПолПолучателя(Получатель)
	
	Если ОбщегоНазначенияСтоматология.ЕстьРеквизитДокумента("ПолКлиента", Получатель.Метаданные()) Тогда
		Возврат Получатель.ПолКлиента;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
